## Python Libraries - Pandas - Merge and Append

In this section, you will merge and concatenate multiple dataframes. Merging is one of the most common operations you will do, since data often comes in various files.

### Merging

For merging, we have sales data across multiple sheets in an Excel file. We will now work with all these sheets and learn to:
* Merge multiple dataframes using common columns/keys using ```pd.merge()```

Let's first read all the data files.

In [2]:
# import the required libraries
import numpy as np
import pandas as pd

In [4]:
# read the sheets from file 'sales_returns.xlsx' into 2 different dataframes - orders and returns
orders = pd.read_excel('sales_returns.xlsx', sheet_name='Orders')
returns = pd.read_excel('sales_returns.xlsx', sheet_name='Returns')

In [5]:
# Check the shape of the dataframe 'orders'
orders

                       Order ID  Market   Profit    Sales
0          AG-2012-AA6453-41020  Africa  53.7600  298.680
1          AG-2012-AC4203-40915  Africa  14.5800   91.380
2          AG-2012-AH2103-41133  Africa  11.0400  276.960
3          AG-2012-AJ7803-40978  Africa   7.1700   35.970
4          AG-2012-AS2853-41235  Africa  15.3600   54.900
...                         ...     ...      ...      ...
25723  US-2015-VM21835140-42252    USCA   6.9654   14.820
25724  US-2015-WB21850140-42349    USCA  12.8767   91.193
25725  US-2015-XP21865140-42287    USCA  16.5440   35.200
25726  US-2015-XP21865140-42323    USCA -22.7882  212.992
25727  US-2015-ZC21910140-42175    USCA  41.1900  148.884

[25728 rows x 4 columns]

In [6]:
# Check the shape of the dataframe 'returns'
returns

     Returned                  Order ID
0         Yes  CA-2012-SA20830140-41210
1         Yes  IN-2012-PB19210127-41259
2         Yes  CA-2012-SC20095140-41174
3         Yes    IN-2015-JH158207-42140
4         Yes    IN-2014-LC168857-41747
...       ...                       ...
1074      Yes   IN-2014-DA1345058-41769
1075      Yes  US-2013-HG14845140-41530
1076      Yes   US-2013-SJ2021582-41543
1077      Yes  CA-2015-EB13870140-42269
1078      Yes    EG-2014-PM894038-41846

[1079 rows x 2 columns]

In [ ]:
# check the dataframe 'orders' and 'returns'

In [7]:
# Create a dataframe 'return_orders' by merging the two dataframes on Order_ID

return_orders = orders.merge(returns, on='Order ID')
# Check the created dataframe
return_orders.head()

                Order ID  Market  Profit    Sales Returned
0  AG-2013-PO88653-41634  Africa  191.25  1932.24      Yes
1  AG-2014-CM21603-41755  Africa   10.32    43.05      Yes
2  AG-2014-CP20853-41889  Africa   14.10    84.72      Yes
3  AG-2014-RD95853-41712  Africa   21.03    64.38      Yes
4  AO-2013-JE57454-41544  Africa  106.59   499.23      Yes

In [9]:
# Check the shape of the new dataframe
return_orders.shape

(1079, 5)

In [11]:
# try to use the 'left' method to join two dataframes
return_orders = orders.merge(returns, on='Order ID', how='left')

# Check the created dataframe
return_orders.head()

               Order ID  Market  Profit   Sales Returned
0  AG-2012-AA6453-41020  Africa   53.76  298.68      NaN
1  AG-2012-AC4203-40915  Africa   14.58   91.38      NaN
2  AG-2012-AH2103-41133  Africa   11.04  276.96      NaN
3  AG-2012-AJ7803-40978  Africa    7.17   35.97      NaN
4  AG-2012-AS2853-41235  Africa   15.36   54.90      NaN

In [13]:
# Check the orders where orders were returned
return_orders[return_orders["Returned"] == "Yes"].head()

                  Order ID  Market  Profit    Sales Returned
35   AG-2013-PO88653-41634  Africa  191.25  1932.24      Yes
44   AG-2014-CM21603-41755  Africa   10.32    43.05      Yes
45   AG-2014-CP20853-41889  Africa   14.10    84.72      Yes
56   AG-2014-RD95853-41712  Africa   21.03    64.38      Yes
111  AO-2013-JE57454-41544  Africa  106.59   499.23      Yes

In [14]:
# Print the dataframe summary using the info() command
return_orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25728 entries, 0 to 25727
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Order ID  25728 non-null  object
 1   Market    25728 non-null  object
 2   Profit    25728 non-null  float64
 3   Sales     25728 non-null  float64
 4   Returned  1079 non-null   object
dtypes: float64(2), object(3)
memory usage: 1.2+ MB

In [18]:
# Change the data type of the column 'Returned' 
return_orders["Returned"] = return_orders["Returned"].astype('str')

# Check the dataframe after modification
return_orders.head()
return_orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25728 entries, 0 to 25727
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Order ID  25728 non-null  object
 1   Market    25728 non-null  object
 2   Profit    25728 non-null  float64
 3   Sales     25728 non-null  float64
 4   Returned  25728 non-null  object
dtypes: float64(2), object(3)
memory usage: 1.2+ MB

In [26]:
# Replace the 'nan' value with 'No' in the column 'Returned'
return_orders["Returned"] = return_orders["Returned"].apply(lambda x : "No" if x == "nan" else "Yes")

# Check the dataframe after modification
return_orders.head()
return_orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25728 entries, 0 to 25727
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Order ID  25728 non-null  object
 1   Market    25728 non-null  object
 2   Profit    25728 non-null  float64
 3   Sales     25728 non-null  float64
 4   Returned  25728 non-null  object
dtypes: float64(2), object(3)
memory usage: 1.2+ MB

### Append / Concatenate

Concatenation is much more straightforward than merging. It is used when you have dataframes having the same columns and want to append them (pile one on top of the other), or having the same rows and want to append them side-by-side.

In [ ]:
# Import the required libraries

**Appending rows in a dataframe**

In [34]:
# Dataframes having the same columns

df1 = pd.DataFrame({'Name': ['Aman', 'Joy', 'Rashmi', 'Saif'],
                    'Age' : ['34', '31', '22', '33'], 
                    'Gender': ['M', 'M', 'F', 'M']}
                  )

df2 = pd.DataFrame({'Name': ['Akhil', 'Asha', 'Preeti'],
                    'Age' : ['31', '22', '23'], 
                    'Gender': ['M', 'F', 'F']}
                  )

In [33]:
# Append the rows of df2 in df1
df1 = df1.append(df2)
df1
#df2

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M
0   Akhil  31      M
1    Asha  22      F
2  Preeti  23      F

**Appending columns in a dataframe**

In [36]:
# Another dataframe with same number of rows as df1
df3 = pd.DataFrame({'School': ['RK Public', 'JSP', 'Carmel Convent', 'St. Paul'],
                    'Graduation Marks': ['84', '89', '76', '91']}
                  )

In [37]:
# Concatenating the dataframes: df1 and df3
pd.concat([df1, df3])

     Name  Age Gender          School Graduation Marks
0    Aman   34      M             NaN              NaN
1     Joy   31      M             NaN              NaN
2  Rashmi   22      F             NaN              NaN
3    Saif   33      M             NaN              NaN
0     NaN  NaN    NaN       RK Public               84
1     NaN  NaN    NaN             JSP               89
2     NaN  NaN    NaN  Carmel Convent               76
3     NaN  NaN    NaN        St. Paul               91

In [38]:
# Concatenating the dataframes across column: df1 and df3
pd.concat([df1, df3], axis = 1)

     Name Age Gender          School Graduation Marks
0    Aman  34      M       RK Public               84
1     Joy  31      M             JSP               89
2  Rashmi  22      F  Carmel Convent               76
3    Saif  33      M        St. Paul               91

In [44]:
gold = pd.DataFrame({'Country': ['USA', 'France', 'Russia'],
                         'Golds': [15, 13, 9]}
                    )
silver = pd.DataFrame({'Country': ['USA', 'Germany', 'Russia'],
                        'Silvers': [29, 20, 16]}
                    )
bronze = pd.DataFrame({'Country': ['France', 'USA', 'UK'],
                        'Bronzes': [40, 28, 27]}
                    )

all_medals = gold.merge(silver, on = 'Country', how = 'outer')
all_medals = all_medals.merge(bronze, on = 'Country', how = 'outer')
all_medals = all_medals.fillna(0)
all_medals['Medals'] = all_medals['Golds'] + all_medals['Silvers'] + all_medals['Bronzes']
all_medals.set_index('Country', inplace = True)
all_medals = all_medals.drop(['Golds', 'Silvers', 'Bronzes'], axis = 1)
print (all_medals.sort_values(by=['Medals'], ascending = False))

         Medals
Country
USA        72.0
France     53.0
UK         27.0
Russia     25.0
Germany    20.0